openfoam/lipinski/cases/packedBedFlow/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(
    volScalarFieldValue alpha.air 1 
);

regions
(
    boxToCell
    {
        box (-0.03 -0.03 -0.01) (0.03 0.03 0.801);
        fieldValues
        (
            volScalarFieldValue alpha.air 0 
        );
    }
);


// ************************************************************************* //
